{
  "sections": {
    "Basic Info": {
      "name": "Seth Parsons",
      "title": "Junior Software Developer",
      "address": "Austin, TX",
      "email" : "work@sethparsons.me",
      "link": "www.linkedin.com/in/sethparsons",
      "summary": "Self-motivated and enthusiastic IT professional with a strong foundation in computer literacy and a lifetime of experience finding and building long-lasting solutions to technology problems. Adept at picking up complicated concepts and programming fields quickly and building sturdy and reliable solutions with excellent communication and documentation."
    },
    "Education": {
      "institutions": [
        {
          "name": "Bachelor's Degree in Computer Science at The University of Texas at Austin",
          "date": "January 2020 - August 2023",
          "gpa": "3.3",
          "classes": "Data Structures, Operating Systems, Software Engineering, Compilers, Intro to Wireless Networks, Game Technology, Ethical Hacking, Artificial Intelligence, iOS Mobile Computing, Competitive Programming"
        }, {
          "name": "General Studies at Austin Community College",
          "date": "August 2018 - May 2020",
          "gpa": "4.0",
          "classes": "Programming Fundamentals I, II, and III, Calculus I, II, and III, Engineering Physics I and II"
        }
      ]
    }, 
    "Professional Experience": {
      "workplaces": [
        {
          "title": "Information Technology Assistant",
          "company": "ATS Engineers, Inspectors, and Surveyors",
          "date": "June 2018 - Present",
          "points": [
              "Deployed hundreds of Windows 10 and Android tablets to building inspectors",
              "Solved various I.T. issues in-office and from home",
              "Assisted contracted software development team in building, maintaining, and documenting internal record-keeping tool",
              "Used Git, Java, Adobe Acrobat, and multiple Atlassian tools to help said team",
              "Also learned and used Spring Boot, IntelliJ, Docker, and other software development tools"
          ]
        }, {
          "title": "Delivery Driver",
          "company": "Jet's Pizza",
          "date": "June 2018 - August 2020",
          "points": [
              "Learned time management and various interpersonal skills",
              "Handled stressful situations and difficult customers"
          ]
        }
      ]
    }, 
    "Projects": {
      "projects": [
        {
          "name": "FuturFindr.me",
          "desc": "Website I built with a team in my Software Engineer class which provides uses a place to scout out a career, housing, and school from one location. Includes a React.js frontend, Flask backend, PostgreSQL database with data scraped from multiple APIs, and a Postman API documentation page."
        }, {
          "name": "Star Fox Forever",
          "desc": "Fan game I built in my Game Technology class using the Godot engine and C++. Mechanics were programmed to be similar to Star Fox 64 but with a infinite procedurally-generated level."
        }, {
          "name": "enable_extensions.py",
          "desc": "Linux backdoor script I wrote in my Ethical Hacking class which adds a remote shell backdoor to the OS as both a cron job and a bashrc script, as well as a systemd service which reinstalls the two other backdoors if it detects either were removed. Installed scripts are given tricky names to avoid detection."
        }, {
          "name": "BPMN Bulk Editing Tool",
          "desc": "Java program I wrote for ATS that helps with creating BPMN diagrams we use for our internal record-keeping tool. Mostly just a JSON find-and-replace tool with some Windows file-editing functionality, but its been extremely useful and saved us a bunch of time."
        }
      ]
    }, 
    "Key Skills": {
      "skills": [
        "Python, Java, C++",
        "Web Development with React.js and Flask",
        "Git, Docker",
        "Atlassian Suite, Microsoft Office",
        "Literate and knowledgable about a wide variety of computing fields"
      ]
    }
  }
}