{
  "sections": {
    "Basic Info": {
      "name": "Seth Parsons",
      "title": "Software Developer",
      "address": "Austin, TX",
      "email" : "work@sethparsons.me",
      "link": "www.linkedin.com/in/sethparsons",
      "summary": "Self-motivated and enthusiastic I.T. professional with a strong foundation in computer literacy and a broad range of knowledge regarding technology and programming. Adept at quickly understanding and integrating into established systems and building sturdy, well-documented software solutions for both end users and other developers."
    },
    "Education": {
      "institutions": [
        {
          "name": "Bachelor's Degree in Computer Science at The University of Texas at Austin",
          "date": "January 2020 - August 2023",
          "gpa": "3.4",
          "classes": "Operating Systems, Software Engineering, Ethical Hacking, Artificial Intelligence"
        }, {
          "name": "General Studies at Austin Community College",
          "date": "August 2018 - May 2020",
          "gpa": "4.0",
          "classes": "Programming Fundamentals, Calculus, Engineering Physics"
        }
      ]
    }, 
    "Key Skills": {
      "skills": [
        "Object-Oriented Programming - Advanced",
        "Software Troubleshooting and Testing - Advanced",
        "Web Development with Continuous Integration/Deployment - Intermediate",
        "Microsoft Office, Adobe Software, Atlassian Software Suites - Advanced",
        "Hardware Installation, Repair, and Maintenance - Advanced",
        "Java, Python, C++ - Advanced (5+ years experience)",
        "Swift, Javascript, HTML/CSS - Intermediate (1-2 years experience)",
        "SQL, C#, x86 ASM - Basic"
      ]
    }, 
    "Professional Experience": {
      "workplaces": [
        {
          "title": "Information Technology Assistant",
          "company": "ATS Engineers, Inspectors, and Surveyors",
          "date": "June 2018 - Present",
          "points": [
              "Assisted with every aspect of the development and implementation of a new internal software system",
              "Wrote Java and Python code that sped up portions of ATS's development workflow by 300%",
              "Extensively used and taught Git, Sourcetree, Jira, Bitbucket, Docker, IntelliJ, and Adobe Acrobat, among others",
              "Testing lead - wrote thousands of lines of documentation and feedback for both developers and end users",
              "Troubleshot and resolved technical issues for over 40 employees, improving IT support satisfaction rates by 50%"
          ]
        }
      ]
    }, 
    "Projects": {
      "projects": [
        {
          "name": "FuturFindr.me",
          "desc": "Dynamic website built in collaboration with a 4-person dev team at UT to help students prepare for and plan their future careers, housing, etc. Includes a React.js frontend, Flask backend, PostgreSQL database with data scraped from multiple APIs, and a Postman documentation page."
        }, {
          "name": "BPMN Bulk Editing Tool",
          "desc": "Spearheaded and single-handedly developed a Java tool deployed at ATS, significantly streamlining the creation of BPMN diagrams used with our internal software. Includes a whole-folder file editing capability which saved other employees countless hours of time."
        }, {
          "name": "Star Fox Forever",
          "desc": "Designed and developed a video game using the Godot engine and C++. Mechanics were programmed to be reminiscent of the beloved Star Fox 64 but with infinite, procedurally-generated levels. Available to download on GitHub."
        }, {
          "name": "enable_extensions.py",
          "desc": "Linux backdoor script written for Ethical Hacking which adds multiple remote shell backdoors to the OS. Programmed using Kali Linux to avoid detection and reinstall itself if removed."
        }, {
          "name": "sethparsons.me",
          "desc": "Personal website made similarly to FuturFindr with the purpose of showing off my projects, hobbies, and resume. Hosted on Amazon Web Services (AWS) using Amplify, EC2, Route 53, and RDS."
        }
      ]
    }
  }
}